swwilshub/rosserial/esp32-firmware/examples/espnow_publisher/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# ESP-NOW relies on the WiFi driver but no station-mode connect.
CONFIG_ESP_WIFI_NVS_ENABLED=n
